package Day020;

public class JavaUtilConcurrent_79 {
    /**
     * java.util.concurrent - папка для работы с мнопоточностью, которая в себе содержит классы, интерфейсы, колдекции
     * которые специально были разработаны для многопоточности.
     *
     * 1.atomic содержит в себе классы которые предназначены для работы с переменными, сысылками, их инкрементами,
     * декрементами и т.д
     *
     * 2.locks - специальные классы которые используются для того чтобы захватывать мониторы обьектов, так сказать
     * замена synchronized, может избавить нас от дедлоков и т.д
     *
     * 3.Специальные колекции для безопасной работы с нашими структурами данных в многопоточностьи ConcurrentMap
     * ConcurrentLinkedQueue и т.д
     *
     * 4.Пулы потоков - упрощают создание потоков
     *
     * 5.Вспомогательные классы для многопоточности которые помогают нам добится решение какой-тр проблемы
     */
}
