package Day1;

public class PrimitiveData_Theory_2 {
    /**
     * В джава существуют 4 типа группы примитивных типов данных:
     * 1.Целочисленные значения:
     *  - byte = занимает 1 байт места в памяти, его размер составляет от -128 - +127;
     *  - short = занимает 2 байта места в памяти, его размер составляет от -32.500 - +32.500;
     *  - int = занимает 4 байта места в памяти, его размер составляет от -2.1млрд - +2.1млрд;
     *  - long занимает 8 байтов места в памяти, его размер составляет от -9.223.372.036.854.775.808 - +9223372036854775807;
     *
     *  2.Числа с плаваюзей точкой(не целые чимла):
     *  - float = 4 байта
     *  - double = 8 байтов
     *
     *  3.Символы:
     *  - char = 2 байта
     *
     *  4.boolean = true/false
     *
     *  Разница бита и байта в том что бит имеет так сказать 1 ячейку в памяти в которой нахлдится 0 или 1
     *  Байт в свою очередь представляет собой 8 битов.
     *
     *  4 самых популярных систем исчисления
     *  1.Двоичная - 0,1;
     *  2.Восьмеричная - 0,1,2,3,4,5,6,7;
     *  3.Десятеричная - 0,1,2,3,4,5,6,7,8,9;
     *  4.Шестнадцатиричная - 0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F;
     */
}
