package Day5;

public class AccessModifier_19 {
    /**
     * Public = модификатор который доступен в самом классе, пакете в котором нахлдится, и даже за его приделами
     *
     * Protected = модификатор который доступен в самом классе, пакете в котором находится, и за его приделами в том
     * случае если какойто класс будет насоеловать тот класс, в котором находится перемення или метод или Класс Protected
     *
     * Default = модификатор который доступен в самом классе, пакете в котором находится.
     *
     * Private = модификатор который доступен только в самом классе в котором был создан.
     */
}